{
  "text only": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "aram",
      "chal",
      "cham",
      "char",
      "chckhey",
      "cheal",
      "chear",
      "checkhey",
      "checkhy",
      "checthy",
      "cheeky",
      "chees",
      "cheey",
      "cheky",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "choly",
      "chos",
      "ckhol",
      "cphol",
      "cthar",
      "cthol",
      "dain",
      "dair",
      "dal",
      "daly",
      "dan",
      "dar",
      "dary",
      "dor",
      "iir",
      "kain",
      "kair",
      "kal",
      "kar",
      "keey",
      "kol",
      "lcheey",
      "lchey",
      "oar",
      "odar",
      "oiin",
      "okal",
      "okaly",
      "okam",
      "okar",
      "okary",
      "okchey",
      "okey",
      "okol",
      "okor",
      "olar",
      "olchey",
      "olkey",
      "olky",
      "olor",
      "ols",
      "opar",
      "otal",
      "otaly",
      "otam",
      "otar",
      "otchey",
      "otey",
      "oto",
      "otol",
      "otor",
      "qockhey",
      "qokey",
      "qol",
      "qotey",
      "rain",
      "sain",
      "sair",
      "sal",
      "sar",
      "shal",
      "shar",
      "shckhey",
      "sheal",
      "shear",
      "shecthy",
      "sheeky",
      "sheky",
      "sheo",
      "sheod",
      "sheol",
      "sheor",
      "shol",
      "shor",
      "sol",
      "sor",
      "tair",
      "tal",
      "tar",
      "ycheey",
      "ykain",
      "ykal",
      "ykar",
      "ykeey",
      "ykeol",
      "ykol",
      "ytain",
      "ytal",
      "ytam",
      "ytar"
    ],
    "non_generic": [
      "chaiin",
      "chedar",
      "chkaiin",
      "chodaiin",
      "chokaiin",
      "cthaiin",
      "daiin",
      "daiir",
      "kaiin",
      "laiin",
      "lkaiin",
      "lkain",
      "odaiin",
      "okaiin",
      "okain",
      "okair",
      "okeal",
      "okees",
      "olaiin",
      "olain",
      "olkaiin",
      "olkal",
      "olkar",
      "opaiin",
      "oraiin",
      "otain",
      "otair",
      "otchol",
      "oteor",
      "qoaiin",
      "qodaiin",
      "qodar",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokaly",
      "qokar",
      "qokchey",
      "qokechy",
      "qokeol",
      "qokeor",
      "qokor",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qotol",
      "saiin",
      "shaiin",
      "shodaiin",
      "ydaiin",
      "ykaiin"
    ]
  },
  "herbal": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "aram",
      "chain",
      "chal",
      "cham",
      "chan",
      "char",
      "chckhey",
      "cheal",
      "chear",
      "checkhey",
      "checkhy",
      "checthy",
      "cheeky",
      "chees",
      "cheey",
      "cheky",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chkeey",
      "chol",
      "choly",
      "chos",
      "ckhol",
      "cphol",
      "cthar",
      "ctheey",
      "cthol",
      "daim",
      "dain",
      "dair",
      "dal",
      "daly",
      "dan",
      "dar",
      "dary",
      "dcheey",
      "dor",
      "iir",
      "kain",
      "kair",
      "kal",
      "kar",
      "kchey",
      "keey",
      "keol",
      "kol",
      "lchey",
      "lkeey",
      "oar",
      "odal",
      "odar",
      "oiin",
      "okal",
      "okaly",
      "okam",
      "okar",
      "okary",
      "okchey",
      "okey",
      "okol",
      "okor",
      "okshy",
      "olar",
      "olchey",
      "olkey",
      "olky",
      "olor",
      "ols",
      "olshey",
      "opar",
      "orol",
      "otal",
      "otaly",
      "otam",
      "otar",
      "otchey",
      "otey",
      "oto",
      "otol",
      "otor",
      "qockhey",
      "qokey",
      "qol",
      "qotey",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhey",
      "sheal",
      "shear",
      "sheckhy",
      "shecthy",
      "sheeky",
      "sheky",
      "sheo",
      "sheod",
      "sheol",
      "sheor",
      "sheos",
      "shocthy",
      "shol",
      "shor",
      "sol",
      "sor",
      "tair",
      "tal",
      "tar",
      "teol",
      "ycheey",
      "ycheo",
      "ycheol",
      "ykain",
      "ykal",
      "ykar",
      "ykeey",
      "ykeol",
      "ykol",
      "ytain",
      "ytal",
      "ytam",
      "ytar"
    ],
    "non_generic": [
      "chaiin",
      "chedar",
      "cheeor",
      "chkaiin",
      "chodaiin",
      "chodar",
      "chokaiin",
      "cthaiin",
      "daiin",
      "daiir",
      "kaiin",
      "laiin",
      "odaiin",
      "odain",
      "okaiin",
      "okain",
      "okair",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olkaiin",
      "olkain",
      "olkar",
      "oraiin",
      "orain",
      "otain",
      "otchol",
      "otchor",
      "oteor",
      "oteos",
      "qoaiin",
      "qodaiin",
      "qodar",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokaly",
      "qokar",
      "qokchey",
      "qokechy",
      "qokeol",
      "qokeor",
      "qokor",
      "qotaiin",
      "qotal",
      "qotar",
      "qoteol",
      "qotol",
      "qotor",
      "saiin",
      "shaiin",
      "shedain",
      "shodaiin",
      "ydaiin",
      "ykaiin"
    ]
  },
  "cosmological": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "aram",
      "chal",
      "cham",
      "char",
      "chckhey",
      "cheal",
      "chear",
      "checkhy",
      "chees",
      "cheey",
      "cheky",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "choly",
      "ctheey",
      "cthol",
      "daim",
      "dain",
      "dair",
      "dal",
      "daly",
      "dan",
      "dar",
      "dary",
      "dcheey",
      "dor",
      "iir",
      "kar",
      "keey",
      "oar",
      "odal",
      "odar",
      "oiin",
      "okal",
      "okar",
      "okary",
      "okchey",
      "okey",
      "okol",
      "okor",
      "okshy",
      "olar",
      "olchey",
      "olkey",
      "olky",
      "olor",
      "ols",
      "opar",
      "orol",
      "otal",
      "otam",
      "otar",
      "otchey",
      "otey",
      "oto",
      "otol",
      "otor",
      "qokey",
      "rain",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "sheal",
      "sheky",
      "sheo",
      "sheol",
      "sheor",
      "sheos",
      "shol",
      "shor",
      "sol",
      "sor",
      "tal",
      "tar",
      "ykal",
      "ykar",
      "ykeey",
      "ykeol",
      "ytain",
      "ytal",
      "ytam",
      "ytar"
    ],
    "non_generic": [
      "cheeor",
      "daiin",
      "daiir",
      "kaiin",
      "laiin",
      "odaiin",
      "odain",
      "okaiin",
      "okain",
      "okair",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olkaiin",
      "olkar",
      "opaiin",
      "oraiin",
      "otain",
      "otair",
      "otchol",
      "otedar",
      "oteos",
      "qodaiin",
      "qodar",
      "qokaiin",
      "qokain",
      "qokal",
      "qokar",
      "qokchey",
      "qokechy",
      "qokeol",
      "qotaiin",
      "qotal",
      "qotar",
      "qoteol",
      "qotor",
      "saiin",
      "shodaiin",
      "ykaiin"
    ]
  },
  "astronomical": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "aram",
      "chear",
      "cheeky",
      "cheey",
      "cheky",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "chos",
      "cphol",
      "dain",
      "dair",
      "dal",
      "dar",
      "dary",
      "dcheey",
      "dor",
      "iir",
      "kchey",
      "keey",
      "keol",
      "odal",
      "oiin",
      "okal",
      "okar",
      "okey",
      "okol",
      "olar",
      "olor",
      "ols",
      "otaly",
      "otar",
      "otchey",
      "otey",
      "oto",
      "otol",
      "otor",
      "qokey",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "sheal",
      "sheo",
      "sheol",
      "shocthy",
      "sol",
      "sor",
      "ycheo",
      "ykar",
      "ykeey"
    ],
    "non_generic": [
      "chedar",
      "chodar",
      "daiin",
      "daiir",
      "odaiin",
      "odain",
      "okain",
      "okchor",
      "okees",
      "okeos",
      "oteos",
      "qokeol",
      "saiin",
      "ydaiin"
    ]
  },
  "unknown": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "aram",
      "chain",
      "chal",
      "cham",
      "chan",
      "char",
      "chckhey",
      "cheal",
      "chear",
      "checkhey",
      "checkhy",
      "checthy",
      "cheeky",
      "chees",
      "cheey",
      "cheky",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chkeey",
      "chol",
      "choly",
      "chos",
      "ckhol",
      "cphol",
      "cthar",
      "ctheey",
      "cthol",
      "daim",
      "dain",
      "dair",
      "dal",
      "daly",
      "dan",
      "dar",
      "dary",
      "dcheey",
      "dor",
      "iir",
      "kain",
      "kair",
      "kal",
      "kar",
      "kchey",
      "keey",
      "keol",
      "kol",
      "lcheey",
      "lchey",
      "lkeey",
      "oar",
      "odal",
      "odar",
      "oiin",
      "okal",
      "okaly",
      "okam",
      "okar",
      "okary",
      "okchey",
      "okey",
      "okol",
      "okor",
      "okshy",
      "olar",
      "olchey",
      "olkey",
      "olky",
      "olor",
      "ols",
      "olshey",
      "opar",
      "orol",
      "otal",
      "otaly",
      "otam",
      "otar",
      "otchey",
      "otey",
      "oto",
      "otol",
      "otor",
      "qockhey",
      "qokey",
      "qol",
      "qotey",
      "rain",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhey",
      "sheal",
      "shear",
      "sheckhy",
      "shecthy",
      "sheeky",
      "sheky",
      "sheo",
      "sheod",
      "sheol",
      "sheor",
      "sheos",
      "shocthy",
      "shol",
      "shor",
      "sol",
      "sor",
      "tair",
      "tal",
      "tar",
      "teol",
      "ycheey",
      "ycheo",
      "ycheol",
      "ykain",
      "ykar",
      "ykeey",
      "ykeol",
      "ykol",
      "ytain",
      "ytal",
      "ytam",
      "ytar"
    ],
    "non_generic": [
      "chaiin",
      "chedar",
      "cheeor",
      "chkaiin",
      "chodaiin",
      "chodar",
      "chokaiin",
      "daiin",
      "daiir",
      "kaiin",
      "laiin",
      "lkaiin",
      "lkain",
      "odaiin",
      "odain",
      "okaiin",
      "okain",
      "okair",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olain",
      "olkaiin",
      "olkain",
      "olkal",
      "olkar",
      "opaiin",
      "oraiin",
      "orain",
      "otain",
      "otair",
      "otchol",
      "otchor",
      "otedar",
      "oteor",
      "oteos",
      "qoaiin",
      "qodaiin",
      "qodar",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokaly",
      "qokar",
      "qokchey",
      "qokechy",
      "qokeol",
      "qokeor",
      "qokor",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qoteol",
      "qotol",
      "qotor",
      "saiin",
      "shaiin",
      "shedain",
      "shodaiin",
      "ydaiin",
      "ykaiin"
    ]
  },
  "biological": {
    "generic": [
      "ain",
      "air",
      "aldy",
      "aral",
      "chain",
      "chal",
      "cham",
      "char",
      "chckhey",
      "cheal",
      "chear",
      "checkhey",
      "checkhy",
      "checthy",
      "cheeky",
      "chees",
      "cheey",
      "cheky",
      "cheol",
      "cheor",
      "ches",
      "chkeey",
      "chol",
      "cphol",
      "cthol",
      "dain",
      "dair",
      "dal",
      "daly",
      "dar",
      "dary",
      "dor",
      "kain",
      "kair",
      "kal",
      "kar",
      "kchey",
      "keey",
      "keol",
      "kol",
      "lcheey",
      "lchey",
      "lkeey",
      "odal",
      "odar",
      "oiin",
      "okal",
      "okaly",
      "okar",
      "okary",
      "okchey",
      "okey",
      "okol",
      "okor",
      "okshy",
      "olar",
      "olchey",
      "olkey",
      "olky",
      "olor",
      "ols",
      "olshey",
      "opar",
      "orol",
      "otal",
      "otaly",
      "otam",
      "otar",
      "otchey",
      "otey",
      "otol",
      "otor",
      "qockhey",
      "qokey",
      "qol",
      "qotey",
      "rain",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhey",
      "sheal",
      "shear",
      "sheckhy",
      "shecthy",
      "sheeky",
      "sheky",
      "sheol",
      "sheor",
      "shol",
      "shor",
      "sol",
      "sor",
      "tal",
      "tar",
      "teol",
      "ycheey",
      "ycheol",
      "ykain",
      "ykal",
      "ykar",
      "ykeey",
      "ykol",
      "ytain",
      "ytal",
      "ytam",
      "ytar"
    ],
    "non_generic": [
      "chedar",
      "cheeor",
      "chkaiin",
      "daiin",
      "kaiin",
      "laiin",
      "lkaiin",
      "lkain",
      "odaiin",
      "okaiin",
      "okain",
      "okair",
      "olaiin",
      "olain",
      "olkaiin",
      "olkain",
      "olkal",
      "olkar",
      "oraiin",
      "orain",
      "otain",
      "otair",
      "otedar",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokaly",
      "qokar",
      "qokchey",
      "qokeol",
      "qokeor",
      "qokor",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qotol",
      "qotor",
      "saiin",
      "ykaiin"
    ]
  }
}
