{
  "text only": {
    "generic": [
      "ain",
      "air",
      "alam",
      "alp",
      "aral",
      "aram",
      "arar",
      "arop",
      "chal",
      "cham",
      "char",
      "chckhe",
      "chckhp",
      "cheal",
      "chear",
      "checkh",
      "checkhe",
      "checth",
      "chee",
      "cheek",
      "cheep",
      "chees",
      "chek",
      "cheo",
      "cheockh",
      "cheok",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "chos",
      "ckhol",
      "cphol",
      "cthar",
      "cthol",
      "iir",
      "kain",
      "kair",
      "kal",
      "kam",
      "kar",
      "kchp",
      "kee",
      "keep",
      "keo",
      "keol",
      "kol",
      "lche",
      "lchee",
      "lchp",
      "oar",
      "oiin",
      "okal",
      "okam",
      "okar",
      "okche",
      "oke",
      "okol",
      "okor",
      "olar",
      "olch",
      "olche",
      "olk",
      "olke",
      "olor",
      "ols",
      "opal",
      "opar",
      "opor",
      "oram",
      "orar",
      "otal",
      "otam",
      "otar",
      "otche",
      "ote",
      "otep",
      "oto",
      "otol",
      "otor",
      "pain",
      "pair",
      "pal",
      "pan",
      "par",
      "pchp",
      "por",
      "qockhe",
      "qoke",
      "qol",
      "qote",
      "rain",
      "sain",
      "sair",
      "sal",
      "sar",
      "shal",
      "shar",
      "shckhe",
      "sheal",
      "shear",
      "shecth",
      "sheek",
      "sheep",
      "shek",
      "sheo",
      "sheol",
      "sheop",
      "sheor",
      "sheos",
      "shet",
      "shok",
      "shol",
      "shor",
      "sol",
      "sor",
      "tain",
      "tair",
      "tal",
      "tam",
      "tar",
      "tchp",
      "teol",
      "teop",
      "tep",
      "top"
    ],
    "non_generic": [
      "chaiin",
      "chepar",
      "chkaiin",
      "chokaiin",
      "chopaiin",
      "chotar",
      "cthaiin",
      "kaiin",
      "laiin",
      "lkaiin",
      "lkain",
      "okaiin",
      "okain",
      "okair",
      "okalp",
      "okchep",
      "okeal",
      "okees",
      "olaiin",
      "olain",
      "olchep",
      "olkaiin",
      "olkal",
      "olkam",
      "olkar",
      "olkep",
      "olshep",
      "opaiin",
      "opchep",
      "oraiin",
      "otain",
      "otair",
      "otchol",
      "oteop",
      "oteor",
      "paiin",
      "paiir",
      "pcheol",
      "poiin",
      "qoaiin",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokar",
      "qokche",
      "qokech",
      "qokeol",
      "qokeop",
      "qokeor",
      "qokep",
      "qokor",
      "qolche",
      "qopaiin",
      "qopar",
      "qopche",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qoteol",
      "qotol",
      "saiin",
      "shaiin",
      "shopaiin"
    ]
  },
  "herbal": {
    "generic": [
      "ain",
      "air",
      "alam",
      "alp",
      "aral",
      "aram",
      "arar",
      "arop",
      "chain",
      "chal",
      "cham",
      "chan",
      "char",
      "chckhe",
      "chckhp",
      "cheal",
      "chear",
      "checkh",
      "checkhe",
      "checth",
      "chee",
      "cheek",
      "cheep",
      "chees",
      "chek",
      "cheo",
      "cheockh",
      "cheok",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chkee",
      "chol",
      "chos",
      "ckhee",
      "ckhol",
      "cphol",
      "cthar",
      "cthee",
      "cthol",
      "iir",
      "kain",
      "kair",
      "kal",
      "kam",
      "kar",
      "kche",
      "kchp",
      "kee",
      "keep",
      "keo",
      "keol",
      "keor",
      "kol",
      "lche",
      "lchp",
      "lkee",
      "oain",
      "oar",
      "oiin",
      "okal",
      "okam",
      "okar",
      "okche",
      "oke",
      "okol",
      "okop",
      "okor",
      "oksh",
      "olar",
      "olch",
      "olche",
      "olk",
      "olke",
      "olor",
      "ols",
      "olshe",
      "opal",
      "opam",
      "opar",
      "opor",
      "oral",
      "oram",
      "orol",
      "otal",
      "otam",
      "otar",
      "otche",
      "ote",
      "otep",
      "oto",
      "otol",
      "otop",
      "otor",
      "paim",
      "pain",
      "pair",
      "pal",
      "pan",
      "par",
      "pchee",
      "pchp",
      "pop",
      "por",
      "qockhe",
      "qoke",
      "qol",
      "qote",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhe",
      "sheal",
      "shear",
      "sheckh",
      "shecth",
      "sheek",
      "sheep",
      "shees",
      "sheet",
      "shek",
      "sheo",
      "sheol",
      "sheop",
      "sheor",
      "sheos",
      "shet",
      "shocth",
      "shok",
      "shol",
      "shor",
      "sol",
      "sor",
      "tain",
      "tair",
      "tal",
      "tam",
      "tar",
      "tchp",
      "teol",
      "teop",
      "tep",
      "top"
    ],
    "non_generic": [
      "chaiin",
      "cheeor",
      "chekal",
      "chekar",
      "chepar",
      "chkaiin",
      "chokaiin",
      "chopaiin",
      "chopar",
      "chotar",
      "cthaiin",
      "kaiin",
      "keeor",
      "laiin",
      "okaiin",
      "okain",
      "okair",
      "okalp",
      "okchep",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olchep",
      "olkaiin",
      "olkain",
      "olkam",
      "olkar",
      "olkep",
      "opaiin",
      "opain",
      "opchep",
      "oraiin",
      "orain",
      "otain",
      "otchol",
      "otchor",
      "oteop",
      "oteor",
      "oteos",
      "paiin",
      "paiir",
      "pcheol",
      "poiin",
      "qoaiin",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokar",
      "qokche",
      "qokech",
      "qokeol",
      "qokeop",
      "qokeor",
      "qokep",
      "qokor",
      "qopaiin",
      "qopar",
      "qopche",
      "qotaiin",
      "qotal",
      "qotar",
      "qoteol",
      "qotol",
      "qotor",
      "saiin",
      "shaiin",
      "shepain",
      "shopaiin",
      "topaiin"
    ]
  },
  "cosmological": {
    "generic": [
      "ain",
      "air",
      "alp",
      "aral",
      "aram",
      "arar",
      "arop",
      "chal",
      "cham",
      "char",
      "chckhe",
      "cheal",
      "chear",
      "checkh",
      "chee",
      "chees",
      "chek",
      "cheo",
      "cheockh",
      "cheok",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "cthee",
      "cthol",
      "iir",
      "kal",
      "kam",
      "kar",
      "kchp",
      "kee",
      "keep",
      "keo",
      "keol",
      "oar",
      "oiin",
      "okal",
      "okar",
      "okche",
      "oke",
      "okol",
      "okop",
      "okor",
      "oksh",
      "olar",
      "olche",
      "olk",
      "olke",
      "olor",
      "ols",
      "opal",
      "opam",
      "opar",
      "opor",
      "orar",
      "orol",
      "otal",
      "otam",
      "otar",
      "otche",
      "ote",
      "otep",
      "oto",
      "otol",
      "otop",
      "otor",
      "paim",
      "pain",
      "pair",
      "pal",
      "pan",
      "par",
      "pchee",
      "pop",
      "por",
      "qoke",
      "rain",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "sheal",
      "sheep",
      "shees",
      "shek",
      "sheo",
      "sheol",
      "sheop",
      "sheor",
      "sheos",
      "shet",
      "shol",
      "shor",
      "sol",
      "sor",
      "tain",
      "tal",
      "tam",
      "tar",
      "tchp",
      "teop",
      "tep",
      "top"
    ],
    "non_generic": [
      "cheeor",
      "chekar",
      "chepar",
      "chotar",
      "kaiin",
      "laiin",
      "okaiin",
      "okain",
      "okair",
      "okchep",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olchep",
      "olkaiin",
      "olkar",
      "olshep",
      "opaiin",
      "opain",
      "opchep",
      "oraiin",
      "otain",
      "otair",
      "otchol",
      "oteop",
      "oteos",
      "otepar",
      "paiin",
      "paiir",
      "qokaiin",
      "qokain",
      "qokal",
      "qokar",
      "qokche",
      "qokech",
      "qokeol",
      "qokeop",
      "qokep",
      "qopaiin",
      "qopar",
      "qotaiin",
      "qotal",
      "qotar",
      "qoteol",
      "qotor",
      "saiin",
      "shopaiin"
    ]
  },
  "astronomical": {
    "generic": [
      "ain",
      "air",
      "alp",
      "aral",
      "aram",
      "chear",
      "chee",
      "cheek",
      "chek",
      "cheo",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chol",
      "chos",
      "ckhee",
      "cphol",
      "iir",
      "kal",
      "kar",
      "kche",
      "kchp",
      "kee",
      "keo",
      "keol",
      "oiin",
      "okal",
      "okar",
      "oke",
      "okol",
      "olar",
      "olor",
      "ols",
      "opal",
      "oral",
      "oram",
      "otal",
      "otar",
      "otche",
      "ote",
      "otep",
      "oto",
      "otol",
      "otor",
      "pain",
      "pair",
      "pal",
      "par",
      "pchee",
      "por",
      "qoke",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "sheal",
      "shees",
      "sheo",
      "sheol",
      "sheop",
      "shet",
      "shocth",
      "shok",
      "sol",
      "sor",
      "teop",
      "top"
    ],
    "non_generic": [
      "chepar",
      "chopar",
      "okain",
      "okalp",
      "okchor",
      "okees",
      "okeos",
      "opaiin",
      "opain",
      "oteos",
      "paiin",
      "paiir",
      "poiin",
      "qokche",
      "qokeol",
      "saiin",
      "topaiin"
    ]
  },
  "unknown": {
    "generic": [
      "ain",
      "air",
      "alam",
      "alp",
      "aral",
      "aram",
      "arar",
      "arop",
      "chain",
      "chal",
      "cham",
      "chan",
      "char",
      "chckhe",
      "chckhp",
      "cheal",
      "chear",
      "checkh",
      "checkhe",
      "checth",
      "chee",
      "cheek",
      "cheep",
      "chees",
      "chek",
      "cheo",
      "cheockh",
      "cheok",
      "cheol",
      "cheor",
      "cheos",
      "ches",
      "chkee",
      "chol",
      "chos",
      "ckhee",
      "ckhol",
      "cphol",
      "cthar",
      "cthee",
      "cthol",
      "iir",
      "kain",
      "kair",
      "kal",
      "kam",
      "kar",
      "kche",
      "kchp",
      "kee",
      "keep",
      "keo",
      "keol",
      "keor",
      "kol",
      "lche",
      "lchee",
      "lchp",
      "lkee",
      "oain",
      "oar",
      "oiin",
      "okal",
      "okam",
      "okar",
      "okche",
      "oke",
      "okol",
      "okop",
      "okor",
      "oksh",
      "olar",
      "olch",
      "olche",
      "olk",
      "olke",
      "olor",
      "ols",
      "olshe",
      "opal",
      "opam",
      "opar",
      "opor",
      "oral",
      "oram",
      "orar",
      "orol",
      "otal",
      "otam",
      "otar",
      "otche",
      "ote",
      "otep",
      "oto",
      "otol",
      "otop",
      "otor",
      "paim",
      "pain",
      "pair",
      "pal",
      "pan",
      "par",
      "pchee",
      "pchp",
      "pop",
      "por",
      "qockhe",
      "qoke",
      "qol",
      "qote",
      "rain",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhe",
      "sheal",
      "shear",
      "sheckh",
      "shecth",
      "sheek",
      "sheep",
      "shees",
      "sheet",
      "shek",
      "sheo",
      "sheol",
      "sheop",
      "sheor",
      "sheos",
      "shet",
      "shocth",
      "shok",
      "shol",
      "shor",
      "sol",
      "sor",
      "tain",
      "tair",
      "tal",
      "tam",
      "tar",
      "tchp",
      "teol",
      "teop",
      "tep",
      "top"
    ],
    "non_generic": [
      "chaiin",
      "cheeor",
      "chekal",
      "chekar",
      "chepar",
      "chkaiin",
      "chokaiin",
      "chopaiin",
      "chopar",
      "chotar",
      "kaiin",
      "keeor",
      "laiin",
      "lkaiin",
      "lkain",
      "okaiin",
      "okain",
      "okair",
      "okalp",
      "okchep",
      "okchor",
      "okeal",
      "okees",
      "okeos",
      "olaiin",
      "olain",
      "olchep",
      "olkaiin",
      "olkain",
      "olkal",
      "olkam",
      "olkar",
      "olkep",
      "olshep",
      "opaiin",
      "opain",
      "opchep",
      "oraiin",
      "orain",
      "otain",
      "otair",
      "otchol",
      "otchor",
      "oteop",
      "oteor",
      "oteos",
      "otepar",
      "paiin",
      "paiir",
      "pcheol",
      "poiin",
      "qoaiin",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokar",
      "qokche",
      "qokech",
      "qokeol",
      "qokeop",
      "qokeor",
      "qokep",
      "qokor",
      "qolche",
      "qopaiin",
      "qopar",
      "qopche",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qoteol",
      "qotol",
      "qotor",
      "saiin",
      "shaiin",
      "shepain",
      "shopaiin",
      "topaiin"
    ]
  },
  "biological": {
    "generic": [
      "ain",
      "air",
      "alp",
      "aral",
      "arar",
      "chain",
      "chal",
      "cham",
      "char",
      "chckhe",
      "chckhp",
      "cheal",
      "chear",
      "checkh",
      "checkhe",
      "checth",
      "chee",
      "cheek",
      "cheep",
      "chees",
      "chek",
      "cheok",
      "cheol",
      "cheor",
      "ches",
      "chkee",
      "chol",
      "cphol",
      "cthol",
      "kain",
      "kair",
      "kal",
      "kam",
      "kar",
      "kche",
      "kchp",
      "kee",
      "keep",
      "keol",
      "kol",
      "lche",
      "lchee",
      "lchp",
      "lkee",
      "oiin",
      "okal",
      "okar",
      "okche",
      "oke",
      "okol",
      "okor",
      "oksh",
      "olar",
      "olch",
      "olche",
      "olk",
      "olke",
      "olor",
      "ols",
      "olshe",
      "opal",
      "opar",
      "opor",
      "oral",
      "oram",
      "orol",
      "otal",
      "otam",
      "otar",
      "otche",
      "ote",
      "otep",
      "otol",
      "otop",
      "otor",
      "pain",
      "pair",
      "pal",
      "par",
      "pchp",
      "por",
      "qockhe",
      "qoke",
      "qol",
      "qote",
      "rain",
      "ram",
      "sain",
      "sair",
      "sal",
      "sam",
      "sar",
      "shal",
      "shar",
      "shckhe",
      "sheal",
      "shear",
      "sheckh",
      "shecth",
      "sheek",
      "sheep",
      "shees",
      "sheet",
      "shek",
      "sheol",
      "sheor",
      "shet",
      "shok",
      "shol",
      "shor",
      "sol",
      "sor",
      "tain",
      "tal",
      "tam",
      "tar",
      "tchp",
      "teol",
      "tep"
    ],
    "non_generic": [
      "cheeor",
      "chekal",
      "chekar",
      "chepar",
      "chkaiin",
      "kaiin",
      "laiin",
      "lkaiin",
      "lkain",
      "okaiin",
      "okain",
      "okair",
      "okalp",
      "okchep",
      "olaiin",
      "olain",
      "olchep",
      "olkaiin",
      "olkain",
      "olkal",
      "olkam",
      "olkar",
      "olkep",
      "olshep",
      "opaiin",
      "opchep",
      "oraiin",
      "orain",
      "otain",
      "otair",
      "otepar",
      "paiin",
      "pcheol",
      "poiin",
      "qokaiin",
      "qokain",
      "qokair",
      "qokal",
      "qokar",
      "qokche",
      "qokeol",
      "qokeor",
      "qokep",
      "qokor",
      "qolche",
      "qotaiin",
      "qotain",
      "qotal",
      "qotar",
      "qotol",
      "qotor",
      "saiin"
    ]
  }
}
